In [1]:
# pip install sql
# pip install ipython-sql
# pip install sqlalchemy

In [2]:
import sqlalchemy

In [3]:
sqlalchemy.__version__

'1.4.46'

In [1]:
%load_ext sql

In [3]:
%sql sqlite:///mi_db.db

In [4]:
%%sql

CREATE TABLE Fam(Name TEXT, Age INTEGER, Profession TEXT, Major TEXT);
INSERT INTO Fam (Name, Age) VALUES('Pam', 50);
INSERT INTO Fam (Name, Age) VALUES('Miranda', 32);
INSERT INTO Fam (Name, Age) VALUES('Pascal', 45);
INSERT INTO Fam (Name, Age) VALUES('Dave', 12);
INSERT INTO Fam (Name, Age) VALUES('Emmy', 23);

 * sqlite:///mi_db.db
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [5]:
%%sql

s

 * sqlite:///mi_db.db
(sqlite3.OperationalError) near "s": syntax error
[SQL: s]
(Background on this error at: https://sqlalche.me/e/14/e3q8)

In [4]:
%sql SELECT * FROM Fam

 * sqlite:///mi_db.db
Done.

[('Pam', 50, 'Unknown', '1'),
 ('Miranda', 32, 'Unknown', '1'),
 ('Pascal', 45, 'Unknown', '1'),
 ('Dave', 12, 'Unknown', '0'),
 ('Emmy', 23, 'Unknown', '1')]

In [7]:
%%sql 
UPDATE Fam SET Profession='Unknown' WHERE Profession ISNULL;
SELECT * FROM Fam

 * sqlite:///mi_db.db
5 rows affected.
Done.

[('Pam', 50, 'Unknown', None),
 ('Miranda', 32, 'Unknown', None),
 ('Pascal', 45, 'Unknown', None),
 ('Dave', 12, 'Unknown', None),
 ('Emmy', 23, 'Unknown', None)]

In [8]:
a = %sql SELECT * FROM Fam

print (a)

 * sqlite:///mi_db.db
Done.
+---------+-----+------------+-------+
|   Name  | Age | Profession | Major |
+---------+-----+------------+-------+
|   Pam   |  50 |  Unknown   |  None |
| Miranda |  32 |  Unknown   |  None |
|  Pascal |  45 |  Unknown   |  None |
|   Dave  |  12 |  Unknown   |  None |
|   Emmy  |  23 |  Unknown   |  None |
+---------+-----+------------+-------+

In [9]:
type(a)

sql.run.ResultSet

In [10]:
a.DataFrame()

      Name  Age Profession Major
0      Pam   50    Unknown  None
1  Miranda   32    Unknown  None
2   Pascal   45    Unknown  None
3     Dave   12    Unknown  None
4     Emmy   23    Unknown  None

In [11]:
type(a.DataFrame())

pandas.core.frame.DataFrame

In [12]:
dato = False

%sql UPDATE Fam SET Major= {dato} WHERE Age < 18

 * sqlite:///mi_db.db
2 rows affected.

[]

In [13]:
%sql SELECT * FROM Fam

 * sqlite:///mi_db.db
Done.

[('Pam', 50, 'Unknown', None),
 ('Miranda', 32, 'Unknown', None),
 ('Pascal', 45, 'Unknown', None),
 ('Dave', 12, 'Unknown', '0'),
 ('Emmy', 23, 'Unknown', None)]

In [10]:
data = True
%sql UPDATE Fam SET Major= :data WHERE Age >=18

 * sqlite:///mi_db.db
6 rows affected.

[]

In [16]:
%sql SELECT * FROM Fam

 * sqlite:///mi_db.db
Done.

[('Pam', 50, 'Unknown', '1'),
 ('Miranda', 32, 'Unknown', '1'),
 ('Pascal', 45, 'Unknown', '1'),
 ('Dave', 12, 'Unknown', '0'),
 ('Emmy', 23, 'Unknown', '1')]

In [64]:
%%sql result << SELECT Name, Profession, Age FROM fam WHERE Major = 1
Order BY Age DESC 
LIMIT 4

 * sqlite:///mi_db.db
Done.
Returning data to local variable result

In [65]:
result

[('Pam', 'Unknown', 50),
 ('Pascal', 'Unknown', 45),
 ('Miranda', 'Unknown', 32),
 ('Emmy', 'Unknown', 23)]

In [66]:
%%sql 
result << select Name , Age  from fam where Major = 1 Order BY Age DESC

 * sqlite:///mi_db.db
Done.
Returning data to local variable result

In [67]:
result

[('Pam', 50), ('Pascal', 45), ('Miranda', 32), ('Emmy', 23)]

In [68]:
result.csv('data.csv')

CSV results at /home/emi/Escritorio/Meta-/Back/04_sql/data.csv

In [55]:
conn = %sql l / --connections

In [56]:
conn

{'sqlite:///mi_db.db': <sql.connection.Connection at 0x7f7226923b20>}

In [6]:
lista = [("emi",47),
          ("belu",42),
           ("luca",12)]

In [8]:
for nombre, edad in lista:
    print(nombre, edad)

    %sql INSERT INTO Fam (Name, Age) VALUES('{nombre}' , '{edad}');

emi 47
 * sqlite:///mi_db.db
1 rows affected.
belu 42
 * sqlite:///mi_db.db
1 rows affected.
luca 12
 * sqlite:///mi_db.db
1 rows affected.

In [13]:
%sql SELECT * FROM Fam

 * sqlite:///mi_db.db
Done.

[('Pam', 50, 'Unknown', '1'),
 ('Miranda', 32, 'Unknown', '1'),
 ('Pascal', 45, 'Unknown', '1'),
 ('Dave', 12, 'Unknown', '0'),
 ('Emmy', 23, 'Unknown', '1'),
 ('emi', 47, None, '1'),
 ('belu', 42, None, '1'),
 ('luca', 12, None, '0')]